#+TITLE: Getting Started with Watchy
#+OPTIONS: tasks:nil

I've recently received my [[https://www.crowdsupply.com/sqfmi/watchy][Watchy]], an open source E-Ink watch, and have
just started to crack the surface of what can be done with the
device. This post outlines how to get going with Watchy from the
perspective of someone who has done very little with Arduino and
hardware programming.

Tested on Debian Sid, steps should be similar across
distributions. Recently moved to Fedora and will be testing shortly.

* Setup

On Debian install the following:

#+begin_src bash
  sudo apt install arduino python3-pyserial
#+end_src

To access the serial connection necessary for uploading to your device
you'll need to add yourself to the =dialout= group.

#+begin_src sh
  sudo adduser $USER dialout
#+end_src

You will need to log out and back in for the change to take full
effect. You can check whether you are in the =dialout= group with:
#+begin_src sh
  groups $USER
#+end_src

#+RESULTS:
: thomas : thomas dialout cdrom floppy sudo audio dip video plugdev netdev bluetooth lpadmin scanner

